; domain
(define (domain transport-strips)
(:requirements :typing :action-costs)

(:types location fuellevel locatable - object 
	package truck - locatable
)

(:predicates 
(connected ?l1 ?l2 - location)
(at ?o - locatable ?l - location)
(in ?p - package ?t - truck)
(fuel ?t - truck ?level - fuellevel)
(fuelcost ?level - fuellevel ?l1 ?l2 - location)
(sum ?a ?b ?c - fuellevel)
)

(:functions 
(total-cost) - number)

(:action LOAD
:parameters
(?p - package
?t - truck
?l - location)
:precondition
(and (at ?t ?l) (at ?p ?l))
:effect
(and (not (at ?p ?l)) (in ?p ?t) (increase (total-cost) 1))
)

(:action UNLOAD
:parameters
(?p - package
?t - truck
?l - location)
:precondition
(and (at ?t ?l) (in ?p ?t))
:effect
(and (at ?p ?l) (not (in ?p ?t)) (increase (total-cost) 1))
)

(:action DRIVE
:parameters
(?t - truck
?l1 - location
?l2 - location
?fuelpost - fuellevel
?fueldelta - fuellevel
?fuelpre - fuellevel)
:precondition
(and 
(connected ?l1 ?l2)
(fuelcost ?fueldelta ?l1 ?l2)
(fuel ?t ?fuelpre)
(sum ?fuelpost ?fueldelta ?fuelpre)
(at ?t ?l1)
)
:effect
(and (not (at ?t ?l1)) 
     (at ?t ?l2) 
     (not (fuel ?t ?fuelpre)) 
     (fuel ?t ?fuelpost)
     (increase (total-cost) 1))
)

)

; problem
(define (problem transport-l7-t1-p5---int100n150-m25---int100c110---s88---e0)
(:domain transport-strips)

(:objects
l0 l1 l2 l3 l4 l5 l6 - location
t0 - truck
p0 p1 p2 p3 p4 - package
level0 level1 level2 level3 level4 level5 level6 level7 level8 level9 level10 level11 level12 level13 level14 level15 level16 level17 level18 level19 level20 level21 level22 level23 level24 level25 level26 level27 level28 level29 level30 level31 level32 level33 level34 level35 level36 level37 level38 level39 level40 level41 level42 level43 level44 level45 level46 level47 level48 level49 level50 level51 level52 level53 level54 level55 level56 level57 level58 level59 level60 level61 level62 level63 level64 level65 level66 level67 level68 level69 level70 level71 level72 level73 level74 level75 level76 level77 level78 level79 level80 level81 level82 level83 level84 level85 level86 level87 level88 level89 level90 level91 level92 level93 level94 level95 level96 level97 level98 level99 level100 level101 level102 level103 level104 level105 level106 level107 level108 level109 level110 level111 level112 level113 level114 level115 level116 level117 level118 level119 level120 level121 level122 level123 level124 - fuellevel
)

(:init
(sum level0 level2 level2)
(sum level0 level9 level9)
(sum level0 level10 level10)
(sum level0 level14 level14)
(sum level0 level17 level17)
(sum level0 level18 level18)
(sum level0 level21 level21)
(sum level0 level23 level23)
(sum level1 level2 level3)
(sum level1 level9 level10)
(sum level1 level10 level11)
(sum level1 level14 level15)
(sum level1 level17 level18)
(sum level1 level18 level19)
(sum level1 level21 level22)
(sum level1 level23 level24)
(sum level2 level2 level4)
(sum level2 level9 level11)
(sum level2 level10 level12)
(sum level2 level14 level16)
(sum level2 level17 level19)
(sum level2 level18 level20)
(sum level2 level21 level23)
(sum level2 level23 level25)
(sum level3 level2 level5)
(sum level3 level9 level12)
(sum level3 level10 level13)
(sum level3 level14 level17)
(sum level3 level17 level20)
(sum level3 level18 level21)
(sum level3 level21 level24)
(sum level3 level23 level26)
(sum level4 level2 level6)
(sum level4 level9 level13)
(sum level4 level10 level14)
(sum level4 level14 level18)
(sum level4 level17 level21)
(sum level4 level18 level22)
(sum level4 level21 level25)
(sum level4 level23 level27)
(sum level5 level2 level7)
(sum level5 level9 level14)
(sum level5 level10 level15)
(sum level5 level14 level19)
(sum level5 level17 level22)
(sum level5 level18 level23)
(sum level5 level21 level26)
(sum level5 level23 level28)
(sum level6 level2 level8)
(sum level6 level9 level15)
(sum level6 level10 level16)
(sum level6 level14 level20)
(sum level6 level17 level23)
(sum level6 level18 level24)
(sum level6 level21 level27)
(sum level6 level23 level29)
(sum level7 level2 level9)
(sum level7 level9 level16)
(sum level7 level10 level17)
(sum level7 level14 level21)
(sum level7 level17 level24)
(sum level7 level18 level25)
(sum level7 level21 level28)
(sum level7 level23 level30)
(sum level8 level2 level10)
(sum level8 level9 level17)
(sum level8 level10 level18)
(sum level8 level14 level22)
(sum level8 level17 level25)
(sum level8 level18 level26)
(sum level8 level21 level29)
(sum level8 level23 level31)
(sum level9 level2 level11)
(sum level9 level9 level18)
(sum level9 level10 level19)
(sum level9 level14 level23)
(sum level9 level17 level26)
(sum level9 level18 level27)
(sum level9 level21 level30)
(sum level9 level23 level32)
(sum level10 level2 level12)
(sum level10 level9 level19)
(sum level10 level10 level20)
(sum level10 level14 level24)
(sum level10 level17 level27)
(sum level10 level18 level28)
(sum level10 level21 level31)
(sum level10 level23 level33)
(sum level11 level2 level13)
(sum level11 level9 level20)
(sum level11 level10 level21)
(sum level11 level14 level25)
(sum level11 level17 level28)
(sum level11 level18 level29)
(sum level11 level21 level32)
(sum level11 level23 level34)
(sum level12 level2 level14)
(sum level12 level9 level21)
(sum level12 level10 level22)
(sum level12 level14 level26)
(sum level12 level17 level29)
(sum level12 level18 level30)
(sum level12 level21 level33)
(sum level12 level23 level35)
(sum level13 level2 level15)
(sum level13 level9 level22)
(sum level13 level10 level23)
(sum level13 level14 level27)
(sum level13 level17 level30)
(sum level13 level18 level31)
(sum level13 level21 level34)
(sum level13 level23 level36)
(sum level14 level2 level16)
(sum level14 level9 level23)
(sum level14 level10 level24)
(sum level14 level14 level28)
(sum level14 level17 level31)
(sum level14 level18 level32)
(sum level14 level21 level35)
(sum level14 level23 level37)
(sum level15 level2 level17)
(sum level15 level9 level24)
(sum level15 level10 level25)
(sum level15 level14 level29)
(sum level15 level17 level32)
(sum level15 level18 level33)
(sum level15 level21 level36)
(sum level15 level23 level38)
(sum level16 level2 level18)
(sum level16 level9 level25)
(sum level16 level10 level26)
(sum level16 level14 level30)
(sum level16 level17 level33)
(sum level16 level18 level34)
(sum level16 level21 level37)
(sum level16 level23 level39)
(sum level17 level2 level19)
(sum level17 level9 level26)
(sum level17 level10 level27)
(sum level17 level14 level31)
(sum level17 level17 level34)
(sum level17 level18 level35)
(sum level17 level21 level38)
(sum level17 level23 level40)
(sum level18 level2 level20)
(sum level18 level9 level27)
(sum level18 level10 level28)
(sum level18 level14 level32)
(sum level18 level17 level35)
(sum level18 level18 level36)
(sum level18 level21 level39)
(sum level18 level23 level41)
(sum level19 level2 level21)
(sum level19 level9 level28)
(sum level19 level10 level29)
(sum level19 level14 level33)
(sum level19 level17 level36)
(sum level19 level18 level37)
(sum level19 level21 level40)
(sum level19 level23 level42)
(sum level20 level2 level22)
(sum level20 level9 level29)
(sum level20 level10 level30)
(sum level20 level14 level34)
(sum level20 level17 level37)
(sum level20 level18 level38)
(sum level20 level21 level41)
(sum level20 level23 level43)
(sum level21 level2 level23)
(sum level21 level9 level30)
(sum level21 level10 level31)
(sum level21 level14 level35)
(sum level21 level17 level38)
(sum level21 level18 level39)
(sum level21 level21 level42)
(sum level21 level23 level44)
(sum level22 level2 level24)
(sum level22 level9 level31)
(sum level22 level10 level32)
(sum level22 level14 level36)
(sum level22 level17 level39)
(sum level22 level18 level40)
(sum level22 level21 level43)
(sum level22 level23 level45)
(sum level23 level2 level25)
(sum level23 level9 level32)
(sum level23 level10 level33)
(sum level23 level14 level37)
(sum level23 level17 level40)
(sum level23 level18 level41)
(sum level23 level21 level44)
(sum level23 level23 level46)
(sum level24 level2 level26)
(sum level24 level9 level33)
(sum level24 level10 level34)
(sum level24 level14 level38)
(sum level24 level17 level41)
(sum level24 level18 level42)
(sum level24 level21 level45)
(sum level24 level23 level47)
(sum level25 level2 level27)
(sum level25 level9 level34)
(sum level25 level10 level35)
(sum level25 level14 level39)
(sum level25 level17 level42)
(sum level25 level18 level43)
(sum level25 level21 level46)
(sum level25 level23 level48)
(sum level26 level2 level28)
(sum level26 level9 level35)
(sum level26 level10 level36)
(sum level26 level14 level40)
(sum level26 level17 level43)
(sum level26 level18 level44)
(sum level26 level21 level47)
(sum level26 level23 level49)
(sum level27 level2 level29)
(sum level27 level9 level36)
(sum level27 level10 level37)
(sum level27 level14 level41)
(sum level27 level17 level44)
(sum level27 level18 level45)
(sum level27 level21 level48)
(sum level27 level23 level50)
(sum level28 level2 level30)
(sum level28 level9 level37)
(sum level28 level10 level38)
(sum level28 level14 level42)
(sum level28 level17 level45)
(sum level28 level18 level46)
(sum level28 level21 level49)
(sum level28 level23 level51)
(sum level29 level2 level31)
(sum level29 level9 level38)
(sum level29 level10 level39)
(sum level29 level14 level43)
(sum level29 level17 level46)
(sum level29 level18 level47)
(sum level29 level21 level50)
(sum level29 level23 level52)
(sum level30 level2 level32)
(sum level30 level9 level39)
(sum level30 level10 level40)
(sum level30 level14 level44)
(sum level30 level17 level47)
(sum level30 level18 level48)
(sum level30 level21 level51)
(sum level30 level23 level53)
(sum level31 level2 level33)
(sum level31 level9 level40)
(sum level31 level10 level41)
(sum level31 level14 level45)
(sum level31 level17 level48)
(sum level31 level18 level49)
(sum level31 level21 level52)
(sum level31 level23 level54)
(sum level32 level2 level34)
(sum level32 level9 level41)
(sum level32 level10 level42)
(sum level32 level14 level46)
(sum level32 level17 level49)
(sum level32 level18 level50)
(sum level32 level21 level53)
(sum level32 level23 level55)
(sum level33 level2 level35)
(sum level33 level9 level42)
(sum level33 level10 level43)
(sum level33 level14 level47)
(sum level33 level17 level50)
(sum level33 level18 level51)
(sum level33 level21 level54)
(sum level33 level23 level56)
(sum level34 level2 level36)
(sum level34 level9 level43)
(sum level34 level10 level44)
(sum level34 level14 level48)
(sum level34 level17 level51)
(sum level34 level18 level52)
(sum level34 level21 level55)
(sum level34 level23 level57)
(sum level35 level2 level37)
(sum level35 level9 level44)
(sum level35 level10 level45)
(sum level35 level14 level49)
(sum level35 level17 level52)
(sum level35 level18 level53)
(sum level35 level21 level56)
(sum level35 level23 level58)
(sum level36 level2 level38)
(sum level36 level9 level45)
(sum level36 level10 level46)
(sum level36 level14 level50)
(sum level36 level17 level53)
(sum level36 level18 level54)
(sum level36 level21 level57)
(sum level36 level23 level59)
(sum level37 level2 level39)
(sum level37 level9 level46)
(sum level37 level10 level47)
(sum level37 level14 level51)
(sum level37 level17 level54)
(sum level37 level18 level55)
(sum level37 level21 level58)
(sum level37 level23 level60)
(sum level38 level2 level40)
(sum level38 level9 level47)
(sum level38 level10 level48)
(sum level38 level14 level52)
(sum level38 level17 level55)
(sum level38 level18 level56)
(sum level38 level21 level59)
(sum level38 level23 level61)
(sum level39 level2 level41)
(sum level39 level9 level48)
(sum level39 level10 level49)
(sum level39 level14 level53)
(sum level39 level17 level56)
(sum level39 level18 level57)
(sum level39 level21 level60)
(sum level39 level23 level62)
(sum level40 level2 level42)
(sum level40 level9 level49)
(sum level40 level10 level50)
(sum level40 level14 level54)
(sum level40 level17 level57)
(sum level40 level18 level58)
(sum level40 level21 level61)
(sum level40 level23 level63)
(sum level41 level2 level43)
(sum level41 level9 level50)
(sum level41 level10 level51)
(sum level41 level14 level55)
(sum level41 level17 level58)
(sum level41 level18 level59)
(sum level41 level21 level62)
(sum level41 level23 level64)
(sum level42 level2 level44)
(sum level42 level9 level51)
(sum level42 level10 level52)
(sum level42 level14 level56)
(sum level42 level17 level59)
(sum level42 level18 level60)
(sum level42 level21 level63)
(sum level42 level23 level65)
(sum level43 level2 level45)
(sum level43 level9 level52)
(sum level43 level10 level53)
(sum level43 level14 level57)
(sum level43 level17 level60)
(sum level43 level18 level61)
(sum level43 level21 level64)
(sum level43 level23 level66)
(sum level44 level2 level46)
(sum level44 level9 level53)
(sum level44 level10 level54)
(sum level44 level14 level58)
(sum level44 level17 level61)
(sum level44 level18 level62)
(sum level44 level21 level65)
(sum level44 level23 level67)
(sum level45 level2 level47)
(sum level45 level9 level54)
(sum level45 level10 level55)
(sum level45 level14 level59)
(sum level45 level17 level62)
(sum level45 level18 level63)
(sum level45 level21 level66)
(sum level45 level23 level68)
(sum level46 level2 level48)
(sum level46 level9 level55)
(sum level46 level10 level56)
(sum level46 level14 level60)
(sum level46 level17 level63)
(sum level46 level18 level64)
(sum level46 level21 level67)
(sum level46 level23 level69)
(sum level47 level2 level49)
(sum level47 level9 level56)
(sum level47 level10 level57)
(sum level47 level14 level61)
(sum level47 level17 level64)
(sum level47 level18 level65)
(sum level47 level21 level68)
(sum level47 level23 level70)
(sum level48 level2 level50)
(sum level48 level9 level57)
(sum level48 level10 level58)
(sum level48 level14 level62)
(sum level48 level17 level65)
(sum level48 level18 level66)
(sum level48 level21 level69)
(sum level48 level23 level71)
(sum level49 level2 level51)
(sum level49 level9 level58)
(sum level49 level10 level59)
(sum level49 level14 level63)
(sum level49 level17 level66)
(sum level49 level18 level67)
(sum level49 level21 level70)
(sum level49 level23 level72)
(sum level50 level2 level52)
(sum level50 level9 level59)
(sum level50 level10 level60)
(sum level50 level14 level64)
(sum level50 level17 level67)
(sum level50 level18 level68)
(sum level50 level21 level71)
(sum level50 level23 level73)
(sum level51 level2 level53)
(sum level51 level9 level60)
(sum level51 level10 level61)
(sum level51 level14 level65)
(sum level51 level17 level68)
(sum level51 level18 level69)
(sum level51 level21 level72)
(sum level51 level23 level74)
(sum level52 level2 level54)
(sum level52 level9 level61)
(sum level52 level10 level62)
(sum level52 level14 level66)
(sum level52 level17 level69)
(sum level52 level18 level70)
(sum level52 level21 level73)
(sum level52 level23 level75)
(sum level53 level2 level55)
(sum level53 level9 level62)
(sum level53 level10 level63)
(sum level53 level14 level67)
(sum level53 level17 level70)
(sum level53 level18 level71)
(sum level53 level21 level74)
(sum level53 level23 level76)
(sum level54 level2 level56)
(sum level54 level9 level63)
(sum level54 level10 level64)
(sum level54 level14 level68)
(sum level54 level17 level71)
(sum level54 level18 level72)
(sum level54 level21 level75)
(sum level54 level23 level77)
(sum level55 level2 level57)
(sum level55 level9 level64)
(sum level55 level10 level65)
(sum level55 level14 level69)
(sum level55 level17 level72)
(sum level55 level18 level73)
(sum level55 level21 level76)
(sum level55 level23 level78)
(sum level56 level2 level58)
(sum level56 level9 level65)
(sum level56 level10 level66)
(sum level56 level14 level70)
(sum level56 level17 level73)
(sum level56 level18 level74)
(sum level56 level21 level77)
(sum level56 level23 level79)
(sum level57 level2 level59)
(sum level57 level9 level66)
(sum level57 level10 level67)
(sum level57 level14 level71)
(sum level57 level17 level74)
(sum level57 level18 level75)
(sum level57 level21 level78)
(sum level57 level23 level80)
(sum level58 level2 level60)
(sum level58 level9 level67)
(sum level58 level10 level68)
(sum level58 level14 level72)
(sum level58 level17 level75)
(sum level58 level18 level76)
(sum level58 level21 level79)
(sum level58 level23 level81)
(sum level59 level2 level61)
(sum level59 level9 level68)
(sum level59 level10 level69)
(sum level59 level14 level73)
(sum level59 level17 level76)
(sum level59 level18 level77)
(sum level59 level21 level80)
(sum level59 level23 level82)
(sum level60 level2 level62)
(sum level60 level9 level69)
(sum level60 level10 level70)
(sum level60 level14 level74)
(sum level60 level17 level77)
(sum level60 level18 level78)
(sum level60 level21 level81)
(sum level60 level23 level83)
(sum level61 level2 level63)
(sum level61 level9 level70)
(sum level61 level10 level71)
(sum level61 level14 level75)
(sum level61 level17 level78)
(sum level61 level18 level79)
(sum level61 level21 level82)
(sum level61 level23 level84)
(sum level62 level2 level64)
(sum level62 level9 level71)
(sum level62 level10 level72)
(sum level62 level14 level76)
(sum level62 level17 level79)
(sum level62 level18 level80)
(sum level62 level21 level83)
(sum level62 level23 level85)
(sum level63 level2 level65)
(sum level63 level9 level72)
(sum level63 level10 level73)
(sum level63 level14 level77)
(sum level63 level17 level80)
(sum level63 level18 level81)
(sum level63 level21 level84)
(sum level63 level23 level86)
(sum level64 level2 level66)
(sum level64 level9 level73)
(sum level64 level10 level74)
(sum level64 level14 level78)
(sum level64 level17 level81)
(sum level64 level18 level82)
(sum level64 level21 level85)
(sum level64 level23 level87)
(sum level65 level2 level67)
(sum level65 level9 level74)
(sum level65 level10 level75)
(sum level65 level14 level79)
(sum level65 level17 level82)
(sum level65 level18 level83)
(sum level65 level21 level86)
(sum level65 level23 level88)
(sum level66 level2 level68)
(sum level66 level9 level75)
(sum level66 level10 level76)
(sum level66 level14 level80)
(sum level66 level17 level83)
(sum level66 level18 level84)
(sum level66 level21 level87)
(sum level66 level23 level89)
(sum level67 level2 level69)
(sum level67 level9 level76)
(sum level67 level10 level77)
(sum level67 level14 level81)
(sum level67 level17 level84)
(sum level67 level18 level85)
(sum level67 level21 level88)
(sum level67 level23 level90)
(sum level68 level2 level70)
(sum level68 level9 level77)
(sum level68 level10 level78)
(sum level68 level14 level82)
(sum level68 level17 level85)
(sum level68 level18 level86)
(sum level68 level21 level89)
(sum level68 level23 level91)
(sum level69 level2 level71)
(sum level69 level9 level78)
(sum level69 level10 level79)
(sum level69 level14 level83)
(sum level69 level17 level86)
(sum level69 level18 level87)
(sum level69 level21 level90)
(sum level69 level23 level92)
(sum level70 level2 level72)
(sum level70 level9 level79)
(sum level70 level10 level80)
(sum level70 level14 level84)
(sum level70 level17 level87)
(sum level70 level18 level88)
(sum level70 level21 level91)
(sum level70 level23 level93)
(sum level71 level2 level73)
(sum level71 level9 level80)
(sum level71 level10 level81)
(sum level71 level14 level85)
(sum level71 level17 level88)
(sum level71 level18 level89)
(sum level71 level21 level92)
(sum level71 level23 level94)
(sum level72 level2 level74)
(sum level72 level9 level81)
(sum level72 level10 level82)
(sum level72 level14 level86)
(sum level72 level17 level89)
(sum level72 level18 level90)
(sum level72 level21 level93)
(sum level72 level23 level95)
(sum level73 level2 level75)
(sum level73 level9 level82)
(sum level73 level10 level83)
(sum level73 level14 level87)
(sum level73 level17 level90)
(sum level73 level18 level91)
(sum level73 level21 level94)
(sum level73 level23 level96)
(sum level74 level2 level76)
(sum level74 level9 level83)
(sum level74 level10 level84)
(sum level74 level14 level88)
(sum level74 level17 level91)
(sum level74 level18 level92)
(sum level74 level21 level95)
(sum level74 level23 level97)
(sum level75 level2 level77)
(sum level75 level9 level84)
(sum level75 level10 level85)
(sum level75 level14 level89)
(sum level75 level17 level92)
(sum level75 level18 level93)
(sum level75 level21 level96)
(sum level75 level23 level98)
(sum level76 level2 level78)
(sum level76 level9 level85)
(sum level76 level10 level86)
(sum level76 level14 level90)
(sum level76 level17 level93)
(sum level76 level18 level94)
(sum level76 level21 level97)
(sum level76 level23 level99)
(sum level77 level2 level79)
(sum level77 level9 level86)
(sum level77 level10 level87)
(sum level77 level14 level91)
(sum level77 level17 level94)
(sum level77 level18 level95)
(sum level77 level21 level98)
(sum level77 level23 level100)
(sum level78 level2 level80)
(sum level78 level9 level87)
(sum level78 level10 level88)
(sum level78 level14 level92)
(sum level78 level17 level95)
(sum level78 level18 level96)
(sum level78 level21 level99)
(sum level78 level23 level101)
(sum level79 level2 level81)
(sum level79 level9 level88)
(sum level79 level10 level89)
(sum level79 level14 level93)
(sum level79 level17 level96)
(sum level79 level18 level97)
(sum level79 level21 level100)
(sum level79 level23 level102)
(sum level80 level2 level82)
(sum level80 level9 level89)
(sum level80 level10 level90)
(sum level80 level14 level94)
(sum level80 level17 level97)
(sum level80 level18 level98)
(sum level80 level21 level101)
(sum level80 level23 level103)
(sum level81 level2 level83)
(sum level81 level9 level90)
(sum level81 level10 level91)
(sum level81 level14 level95)
(sum level81 level17 level98)
(sum level81 level18 level99)
(sum level81 level21 level102)
(sum level81 level23 level104)
(sum level82 level2 level84)
(sum level82 level9 level91)
(sum level82 level10 level92)
(sum level82 level14 level96)
(sum level82 level17 level99)
(sum level82 level18 level100)
(sum level82 level21 level103)
(sum level82 level23 level105)
(sum level83 level2 level85)
(sum level83 level9 level92)
(sum level83 level10 level93)
(sum level83 level14 level97)
(sum level83 level17 level100)
(sum level83 level18 level101)
(sum level83 level21 level104)
(sum level83 level23 level106)
(sum level84 level2 level86)
(sum level84 level9 level93)
(sum level84 level10 level94)
(sum level84 level14 level98)
(sum level84 level17 level101)
(sum level84 level18 level102)
(sum level84 level21 level105)
(sum level84 level23 level107)
(sum level85 level2 level87)
(sum level85 level9 level94)
(sum level85 level10 level95)
(sum level85 level14 level99)
(sum level85 level17 level102)
(sum level85 level18 level103)
(sum level85 level21 level106)
(sum level85 level23 level108)
(sum level86 level2 level88)
(sum level86 level9 level95)
(sum level86 level10 level96)
(sum level86 level14 level100)
(sum level86 level17 level103)
(sum level86 level18 level104)
(sum level86 level21 level107)
(sum level86 level23 level109)
(sum level87 level2 level89)
(sum level87 level9 level96)
(sum level87 level10 level97)
(sum level87 level14 level101)
(sum level87 level17 level104)
(sum level87 level18 level105)
(sum level87 level21 level108)
(sum level87 level23 level110)
(sum level88 level2 level90)
(sum level88 level9 level97)
(sum level88 level10 level98)
(sum level88 level14 level102)
(sum level88 level17 level105)
(sum level88 level18 level106)
(sum level88 level21 level109)
(sum level88 level23 level111)
(sum level89 level2 level91)
(sum level89 level9 level98)
(sum level89 level10 level99)
(sum level89 level14 level103)
(sum level89 level17 level106)
(sum level89 level18 level107)
(sum level89 level21 level110)
(sum level89 level23 level112)
(sum level90 level2 level92)
(sum level90 level9 level99)
(sum level90 level10 level100)
(sum level90 level14 level104)
(sum level90 level17 level107)
(sum level90 level18 level108)
(sum level90 level21 level111)
(sum level90 level23 level113)
(sum level91 level2 level93)
(sum level91 level9 level100)
(sum level91 level10 level101)
(sum level91 level14 level105)
(sum level91 level17 level108)
(sum level91 level18 level109)
(sum level91 level21 level112)
(sum level91 level23 level114)
(sum level92 level2 level94)
(sum level92 level9 level101)
(sum level92 level10 level102)
(sum level92 level14 level106)
(sum level92 level17 level109)
(sum level92 level18 level110)
(sum level92 level21 level113)
(sum level92 level23 level115)
(sum level93 level2 level95)
(sum level93 level9 level102)
(sum level93 level10 level103)
(sum level93 level14 level107)
(sum level93 level17 level110)
(sum level93 level18 level111)
(sum level93 level21 level114)
(sum level93 level23 level116)
(sum level94 level2 level96)
(sum level94 level9 level103)
(sum level94 level10 level104)
(sum level94 level14 level108)
(sum level94 level17 level111)
(sum level94 level18 level112)
(sum level94 level21 level115)
(sum level94 level23 level117)
(sum level95 level2 level97)
(sum level95 level9 level104)
(sum level95 level10 level105)
(sum level95 level14 level109)
(sum level95 level17 level112)
(sum level95 level18 level113)
(sum level95 level21 level116)
(sum level95 level23 level118)
(sum level96 level2 level98)
(sum level96 level9 level105)
(sum level96 level10 level106)
(sum level96 level14 level110)
(sum level96 level17 level113)
(sum level96 level18 level114)
(sum level96 level21 level117)
(sum level96 level23 level119)
(sum level97 level2 level99)
(sum level97 level9 level106)
(sum level97 level10 level107)
(sum level97 level14 level111)
(sum level97 level17 level114)
(sum level97 level18 level115)
(sum level97 level21 level118)
(sum level97 level23 level120)
(sum level98 level2 level100)
(sum level98 level9 level107)
(sum level98 level10 level108)
(sum level98 level14 level112)
(sum level98 level17 level115)
(sum level98 level18 level116)
(sum level98 level21 level119)
(sum level98 level23 level121)
(sum level99 level2 level101)
(sum level99 level9 level108)
(sum level99 level10 level109)
(sum level99 level14 level113)
(sum level99 level17 level116)
(sum level99 level18 level117)
(sum level99 level21 level120)
(sum level99 level23 level122)
(sum level100 level2 level102)
(sum level100 level9 level109)
(sum level100 level10 level110)
(sum level100 level14 level114)
(sum level100 level17 level117)
(sum level100 level18 level118)
(sum level100 level21 level121)
(sum level100 level23 level123)
(sum level101 level2 level103)
(sum level101 level9 level110)
(sum level101 level10 level111)
(sum level101 level14 level115)
(sum level101 level17 level118)
(sum level101 level18 level119)
(sum level101 level21 level122)
(sum level101 level23 level124)
(sum level102 level2 level104)
(sum level102 level9 level111)
(sum level102 level10 level112)
(sum level102 level14 level116)
(sum level102 level17 level119)
(sum level102 level18 level120)
(sum level102 level21 level123)
(sum level103 level2 level105)
(sum level103 level9 level112)
(sum level103 level10 level113)
(sum level103 level14 level117)
(sum level103 level17 level120)
(sum level103 level18 level121)
(sum level103 level21 level124)
(sum level104 level2 level106)
(sum level104 level9 level113)
(sum level104 level10 level114)
(sum level104 level14 level118)
(sum level104 level17 level121)
(sum level104 level18 level122)
(sum level105 level2 level107)
(sum level105 level9 level114)
(sum level105 level10 level115)
(sum level105 level14 level119)
(sum level105 level17 level122)
(sum level105 level18 level123)
(sum level106 level2 level108)
(sum level106 level9 level115)
(sum level106 level10 level116)
(sum level106 level14 level120)
(sum level106 level17 level123)
(sum level106 level18 level124)
(sum level107 level2 level109)
(sum level107 level9 level116)
(sum level107 level10 level117)
(sum level107 level14 level121)
(sum level107 level17 level124)
(sum level108 level2 level110)
(sum level108 level9 level117)
(sum level108 level10 level118)
(sum level108 level14 level122)
(sum level109 level2 level111)
(sum level109 level9 level118)
(sum level109 level10 level119)
(sum level109 level14 level123)
(sum level110 level2 level112)
(sum level110 level9 level119)
(sum level110 level10 level120)
(sum level110 level14 level124)
(sum level111 level2 level113)
(sum level111 level9 level120)
(sum level111 level10 level121)
(sum level112 level2 level114)
(sum level112 level9 level121)
(sum level112 level10 level122)
(sum level113 level2 level115)
(sum level113 level9 level122)
(sum level113 level10 level123)
(sum level114 level2 level116)
(sum level114 level9 level123)
(sum level114 level10 level124)
(sum level115 level2 level117)
(sum level115 level9 level124)
(sum level116 level2 level118)
(sum level117 level2 level119)
(sum level118 level2 level120)
(sum level119 level2 level121)
(sum level120 level2 level122)
(sum level121 level2 level123)
(sum level122 level2 level124)

(connected l0 l2)
(fuelcost level21 l0 l2)
(connected l0 l3)
(fuelcost level23 l0 l3)
(connected l0 l6)
(fuelcost level10 l0 l6)
(connected l1 l2)
(fuelcost level9 l1 l2)
(connected l1 l4)
(fuelcost level18 l1 l4)
(connected l1 l5)
(fuelcost level10 l1 l5)
(connected l1 l6)
(fuelcost level2 l1 l6)
(connected l2 l0)
(fuelcost level21 l2 l0)
(connected l2 l1)
(fuelcost level9 l2 l1)
(connected l2 l5)
(fuelcost level17 l2 l5)
(connected l3 l0)
(fuelcost level23 l3 l0)
(connected l3 l5)
(fuelcost level14 l3 l5)
(connected l4 l1)
(fuelcost level18 l4 l1)
(connected l5 l1)
(fuelcost level10 l5 l1)
(connected l5 l2)
(fuelcost level17 l5 l2)
(connected l5 l3)
(fuelcost level14 l5 l3)
(connected l5 l6)
(fuelcost level9 l5 l6)
(connected l6 l0)
(fuelcost level10 l6 l0)
(connected l6 l1)
(fuelcost level2 l6 l1)
(connected l6 l5)
(fuelcost level9 l6 l5)

(at t0 l4)
(fuel t0 level124)
(= (total-cost) 0)

(at p0 l5)
(at p1 l1)
(at p2 l6)
(at p3 l3)
(at p4 l3)
)

(:goal
(and
(at p0 l0)
(at p1 l3)
(at p2 l2)
(at p3 l1)
(at p4 l4)
)
)
(:metric minimize (total-cost)))

; plan
1. (drive t0 l4 l1 level106 level18 level124)
   deleted: (at t0 l4) (fuel t0 level124)
   added: (at t0 l1) (fuel t0 level106)
   goals met: 0 of 5
2. (load p1 t0 l1)
   deleted: (at p1 l1)
   added: (in p1 t0)
   goals met: 0 of 5
3. (drive t0 l1 l6 level104 level2 level106)
   deleted: (at t0 l1) (fuel t0 level106)
   added: (at t0 l6) (fuel t0 level104)
   goals met: 0 of 5
4. (load p2 t0 l6)
   deleted: (at p2 l6)
   added: (in p2 t0)
   goals met: 0 of 5
5. (drive t0 l6 l5 level95 level9 level104)
   deleted: (at t0 l6) (fuel t0 level104)
   added: (at t0 l5) (fuel t0 level95)
   goals met: 0 of 5
6. (load p0 t0 l5)
   deleted: (at p0 l5)
   added: (in p0 t0)
   goals met: 0 of 5
7. (drive t0 l5 l3 level81 level14 level95)
   deleted: (at t0 l5) (fuel t0 level95)
   added: (at t0 l3) (fuel t0 level81)
   goals met: 0 of 5
8. (unload p1 t0 l3)
   deleted: (in p1 t0)
   added: (at p1 l3)
   goals met: 1 of 5
9. (load p4 t0 l3)
   deleted: (at p4 l3)
   added: (in p4 t0)
   goals met: 1 of 5
10. (load p3 t0 l3)
   deleted: (at p3 l3)
   added: (in p3 t0)
   goals met: 1 of 5
11. (drive t0 l3 l0 level58 level23 level81)
   deleted: (at t0 l3) (fuel t0 level81)
   added: (at t0 l0) (fuel t0 level58)
   goals met: 1 of 5
12. (unload p0 t0 l0)
   deleted: (in p0 t0)
   added: (at p0 l0)
   goals met: 2 of 5
13. (drive t0 l0 l2 level37 level21 level58)
   deleted: (at t0 l0) (fuel t0 level58)
   added: (at t0 l2) (fuel t0 level37)
   goals met: 2 of 5
14. (unload p2 t0 l2)
   deleted: (in p2 t0)
   added: (at p2 l2)
   goals met: 3 of 5
15. (drive t0 l2 l1 level28 level9 level37)
   deleted: (at t0 l2) (fuel t0 level37)
   added: (at t0 l1) (fuel t0 level28)
   goals met: 3 of 5
16. (unload p3 t0 l1)
   deleted: (in p3 t0)
   added: (at p3 l1)
   goals met: 4 of 5
17. (drive t0 l1 l4 level10 level18 level28)
   deleted: (at t0 l1) (fuel t0 level28)
   added: (at t0 l4) (fuel t0 level10)
   goals met: 4 of 5
18. (unload p4 t0 l4)
   deleted: (in p4 t0)
   added: (at p4 l4)
   goals met: 5 of 5
